<template>
    <div class="home">
        <h1 class="title font-weight-light grey-darken-3--text">Что такое программа iDA?</h1>

        <v-divider class="my-4"></v-divider>

        <v-container fluid class="mx-0 pa-0">
            <v-layout row wrap>
                <v-flex xs12>
                    <div>
                        Гарантия на выполненный ремонт рулевой рейки -
                        6 месяцев, без учета пробега!
                        запись на ремонт, и стоимость работ уточняйте у нашего менеджера
                        Работаем ежедневно с 10:00 до 20:00
                        Телефоны:
                        8-906-056-05-07
                        8-906-056-05-02
                        8-916-883-55-56
                        8-925-777-41-42
                        gur24.ru@mail.ru
                        Skype:
                        master--gur
                    </div>
                </v-flex>
                <v-flex xs12>
                    <div>
                        Gur24.ru это интернет платформа, на которой можно получить информацию о рулевой рейке, записаться на ремонт по телефону, купить автозапчасти рулевого управления 24 часа в сутки. А также купить франшизу и организовать свое собственное высокодоходное предприятие по ремонту и восстановлению устройства гидроусилителя руля (ГУР) и электроусилителя руля (ЭУР). Охотно работаем с регионами.Вы можете послать нам дефектную рулевую рейку на восстановление. Ознакомится с перечнем имеющихся на складе восстановленных и новых рулевых реек, а также насосов ГУР по ссылке "Наличие на складе"
Ремонт рулевых реек в Москве в СВАО
 
Ремонт рулевой рейки – сложный и скрупулезный процесс,
 
требующий специального оборудования, материальных затрат,
 
специального умения и навыков.
 
Ремонт рулевых реек состоит из нескольких этапов:
 
Разборка рулевой рейки и тщательная промывка всех ее деталей;
 
Замена деталей рулевой рейки, которые не подлежат восстановлению;
 
Чистится и проверяется зубчатый вал рулевой рейки;
 
На рулевой рейке заменяются: пыльники, сальники, кольца и другие
 
компоненты.Ремонт рулевой рейки может занимать от нескольких часов до
 
одного дня. Все зависит от износа и повреждений рулевой рейки.
 
После окончания ремонта, рулевой рейки, она проходит несколько
 
этапов проверок на современном диагностическом оборудовании.
 
 
Рулевая рейка состоит из следующих компонентов:
 
 
Зубчатый вал – главная и самая ответственная деталь рулевой рейки;
 
Опорная втулка;
 
Золотниковый механизм.
 
Ремонт рулевой рейки, ремонт гидроусилителя в Москве в СВАО на
 
Ярославке производят опытные специалисты компании ,которые проходили 
 
обучение и стажировку в Германии ,что позволяет компании предоставлять 
 
гарантию на восстановленную рулевую рейку до 6 месяцев.
 
 
 
Ремонт рулевой рейки в Москве на Ярославке Москва,улица Докукина, 16с4
                    </div>
                </v-flex>
                <v-flex xs12>
                    
                    <yandex-map
                    :coords="[55.841609, 37.650037]"
                    zoom="16"
                    style="width: 600px; height: 600px;"
                    :cluster-options="{
                        1: {clusterDisableClickZoom: true}
                    }"
                    :behaviors="['ruler']"
                    :controls="['trafficControl']"
                    :placemarks="placemarks"
                    map-type="hybrid"
                    @map-was-initialized="initHandler"
                    >

                        <ymap-marker
                        marker-id="1"
                        marker-type="placemark"
                        :coords="[55.841609, 37.650037]"
                        hint-content="Hint content 1"
                        :balloon="{header: 'header', body: 'body', footer: 'footer'}"
                        :icon="{color: 'green', glyph: 'cinema'}"
                        cluster-name="1"
                        ></ymap-marker>

                        <ymap-marker
                        marker-id="2"
                        marker-type="placemark"
                        :coords="[55.841609, 37.650037]"
                        hint-content="Hint content 1"
                        :balloon="{header: 'header', body: 'body', footer: 'footer'}"
                        :icon="{color: 'green', glyph: 'cinema'}"
                        cluster-name="1"
                        ></ymap-marker>

                    </yandex-map>         
                </v-flex>
            </v-layout>
        </v-container>

    </div>
</template>


<script>
//import Navbar from '@/components/Navbar'
export default {
  name: 'App',
  components: {
 //   Navbar
  },
  data () {
    return {
        placemarks: [
            {
                coords: [55.841609, 37.650037],
                properties: {}, // define properties here
                options: {}, // define options here
                clusterName: "1",
                balloonTemplate: '<div>"Your custom template"</div>',
                callbacks: { click: function() {} }
            }
            ]
    }
  }

}
</script>